abdominal-muscles
abductor-muscle-force
abductor-pollicis-longus
adduction-movements
adductor-brevis
adductor-group
adductor-longus
adductor-tubercle
adjacent-vertebrae
adjacent-vertebral-bodies
adult-femur-varies
adult-spinal-curves
anatomical-language
anatomical-neck
anatomy-field-experiences
angular-acceleration
ankle-foot-module
ankle-joint
ankle-muscle-action
ankle-muscles
annulus-fibrosus
annulus-fibrosus-tears
anterior-compartment
anterior-cruciate-ligament
anterior-distal-medial-humerus
anterior-drawer
anterior-femur
anterior-forearm
anterior-iliac-crest
anterior-ligaments
anterior-muscles
anterior-pelvis
anterior-proximal
anterior-proximal-tibia
anterior-sacroiliac-ligament
anterior-sternoclavicular-ligament
anterolateral-proximal-radius
anterolateral-ribs
ap-diameter-varies
arm-moves
articular-cartilage-due
articular-processes
avascular-necrosis
avascular-necrosis-results
axial-skeleton
axial-skeleton-articulate
axial-skeleton-redux
bifid-spinous-process
bigger-supraorbital-ridges
blue-muscle-shortens
brachii-short-head
brain-activate-muscles
capitis-mastoid-process
carpal-bones
carpal-tunnel
carpal-tunnel-syndrome
carpi-radialis
carpi-ulnaris
cartilage-surface
case-muscle-torque
cervical-spine
cervical-vertebra-changes
cervical-vertebrae
cervicis-transverse-processes
chiari-pelvic-osteotomy
chondroitin-sulfate-sidechains
clavicular-head
clavicular-head-flexes
college-years
common-extensor-tendon
common-flexor-tendon
concentric-muscle-action
condyloid-synovial-joint
connective-tissue
connective-tissue-types
contralateral-rotation
contralateral-rotator
cross-bridges
cruciate-ligament-injury
deep-external-rotators
deep-lateral-rotators
deep-lateral-rotators-group
deep-rotators
deepest-posterior-muscles
deepest-spine-flexor-muscle
define-muscle-agonists
dense-fibrous-tissue
describe-musculoskeletal-injuries
describe-sex-differences
describe-unique-features
different-functions
different-muscle-designs
digitorum-brevis
digitorum-profundus
digitorum-superficialis
distal-anterior-fibula
distal-anterior-humerus
distal-anterior-radius
distal-anterior-ulna
distal-femur
distal-interphalangeal-joints
distal-interphalangeal-jts
distal-lateral-fibula
distal-medial-posterior-aspect
distal-posterior
distal-posterior-fibula
distal-tibia
distal-tibiofibular-joint
dorsi-extends
downward-rotate
downward-rotator
due-dates
elbow-extensor
elbow-flexes
elbow-flexion
elbow-flexor
elbow-joint
erector-spinae
erector-spinae-muscles
erector-spinae-organization
estensor-digitorum-longus
excessive-adduction
explain-ankle-sprains
ext-carpi-radialis-longus
extension-adduction-medial-rotation
extensor-caroi-ulnaris
extensor-carpi-radialis-brevis
extensor-carpi-radialis-longus
extensor-carpi-ulnaris
extensor-carpi-ulnaris-extends
extensor-digiti-minimi
extensor-digitorum
extensor-digitorum-brevis
extensor-digitorum-longus
extensor-expansion
extensor-hallucis-longus
extensor-muscle-torque
extensor-muscles
extensor-pollicis-brevis
extensor-pollicis-longus
extensor-torque
external-auditory-meatus
external-occipital-protuberance
external-torque
femoral-head-passes
femoris-short-head
femoris-shortens
fibrocartilage-joint
fibrocartilage-rim-deepens
fibrous-joint
flat-bones
flat-tibial-plateau
flexes-proximal-interphalangeal-jt
flexion-extension
flexor-carpi-radialis
flexor-carpi-ulnaris
flexor-digitorum-longus
flexor-digitorum-profundus
flexor-digitorum-superficialis
flexor-direction
flexor-hallucis-longus
flexor-muscle-torque
flexor-pollicis-longus
flexor-torque
foot-bones
foot-contact-events
foot-joints
foot-movements
foot-muscles
force-length-relationship-varies
frontal-bone
frontal-plane-movements
frontal-plane-rotate
frontal-spine-movements
frontal-wrist-movements
functional-contractile-unit
gait-pattern
girdle-module
gluteus-maximus
gluteus-maximus-varies
gravity-torque
great-practice-materials
greater-sciatic-notch
greater-trochanter
greater-tubercle
greatest-compressive-loads
gross-et-al
head-infraglenoid-tubercle
hinge-joint
hinge-synovial-joint
hip-abductor-strength
hip-adduction
hip-adductor-group
hip-control-frontal-plane-motions
hip-control-sagittal-plane-motions
hip-control-transverse-plane-motions
hip-extensors
hip-flexion
hip-flexors
hip-hyperextension
hip-joint
hip-joint-extends
hip-module
hip-muscles
human-muscles
human-musculoskeletal-anatomy
hyaline-cartilage
hyaline-cartilage-breaks
hyaluronic-acid-backbone
iliac-crest
iliac-fossa
inferior-iliac-spine
inferior-nuchal-lines
inferior-pubic-ramus
inferior-ramus
inferior-ribs-move
infraglenoid-process
injury-results
insertion-greater-trochanter
interphalangeal-joints
intervertebral-discs
intervertebral-discs-increases
intervertebral-foramina
ipsilateral-foot-contact
ipsilateral-rotation
ipsilateral-rotator
isometric-action
isometric-muscle-action
job-shadow-opportunities
joint-angle-increases
joint-capsule
joint-changes
joint-extends
joint-moves
joint-types
kinesiology-career-fair
kinesiology-scientific-basis
knee-ankle-foot-muscles
knee-extensor
knee-extensor-muscles
knee-flexion
knee-flexor-muscles
knee-flexors
knee-hyperextension
knee-joint-flexes
knee-muscle-torque
large-compression-loads
larger-mastoid-process
lateral-carpal-bone
lateral-compartment
lateral-condyle
lateral-epicondyle
lateral-femoral-epicondyle
lateral-femur
lateral-flexion
lateral-flexors
lateral-ligaments-tear
lateral-pterygoid
lateral-pterygoid-muscles
lateral-rotation-posterior
lateral-rotators
lateral-supracondylar-ridge
lateral-tibia
lateral-tibial-condyle
lateral-tibial-rotation
latissimus-dorsi
latissimus-dorsi-share
ligaments-function
limits-hip-hyperextension
linea-aspera
longer-mandibular-ramus
longitudinal-muscle
longus-capitis
lumbar-vertebrae
major-extends
male-mastoid-process
mandibular-condyle
many-elbow-extensors
many-external-forces
many-motions
many-muscles
many-posterior-muscles
many-vertebrae
mastoid-process
medial-aspect
medial-collateral-ligament
medial-condyle
medial-epicondyle
medial-femoral-epicondyle
medial-head
medial-lateral
medial-lateral-axis
medial-ligaments-tear
medial-posterior-tibia
medial-pterygoid
medial-rotation
medial-rotator
medial-surface
medial-tibia
medial-tibial-rotation
medial-view
median-sacral-crest
movement-results
muscle-groups-function
muscle-shortens
muscle-tissue
muscle-torque
muscles-groups-act
muscles-share
musculoskeletal-anatomical-knowledge
musculoskeletal-anatomy
myosin-cross-bridges
naledi-hominid-foot
neck-flexes
neck-flexors
neck-muscle-functions
net-joint-angular-acceleration
occipital-bone
osgood-schlatter-disease
osteoarthritis-bone-spurs
patellar-ligament
pectoralis-major
pectoralis-major-adduct
pectoralis-major-forms
pelvic-girdle
pelvic-inlet
pelvic-inlet-ap
pelvis-frontal-movements
plantar-surface
pollicis-longus
poor-patellar
posterior-cruciate-ligament
posterior-distal-femur
posterior-drawer
posterior-femur
posterior-forearm
posterior-inferior-iliac-spine
posterior-lateral-femur
posterior-lateral-patella
posterior-ligaments
posterior-longitudinal-ligament
posterior-muscles
posterior-patella
posterior-proximal
posterior-radius
posterior-rotation
posterior-sacroiliac-ligament
posterior-spine-muscles
posterior-superior-iliac-spine
posterior-tibia
posterior-ulna
practice-materials
proximal-femur
proximal-interphalangeal-joints
proximal-lateral-fibula
proximal-linea-aspera
proximal-medial-femur
proximal-medial-tibia
proximal-posterior-ulna
proximal-posterolateral-ulna
proximal-radioulnar-joint
proximal-tibia
proximal-tibiofibular-joint
proximal-ulna
psoas-major
pterygoid-muscles
pubic-crest
pubic-symphysis
pubic-symphysis-shorter
pubic-symphysis-taller
pubic-tubercle
quadriceps-femoris
quadriceps-femoris-tendon
radial-collateral
radial-head-articulates
radial-notch
radial-styloid-process
radial-ulnar-supination
radioulnar-joint
ray-moon-worlds-oldest-body-builder
rectus-abdominis
rectus-abdominis-muscles
rectus-abdominis-shortens
rectus-capitis-anterior
rectus-capitis-lateralis
rectus-femoris
red-muscle-shortens
review-lecture-videos
right-erector-spinae-muscles
right-scalenus-muscles
rotator-cuff-group
rotator-cuff-muscles
sacral-foramina
sacroiliac-joint
saddle-synovial-joint
sagittal-ankle-movements
sagittal-jaw-movements
sagittal-pelvis-movements
sagittal-plane
sagittal-plane-movements
sagittal-plane-rotate
scalenes-compress-nerves
scalenus-anterior
scalenus-posterior
sciatic-notch
sex-differences
short-bones
short-plantar-ligament
short-videos
shoulder-flexion
shoulder-girdle
shoulder-girdle-motions
shoulder-motions
shoulder-muscle-redux
shoulder-muscles
skeleton-module
skeleton-redux-module
small-pelvic-inlet
small-thin-bones
smooth-hyaline-cartilage
smooth-joint-surfaces
socket-synovial-joint
specific-muscle-groups
spinae-muscles
spinal-nerve-roots
spine-contralateral-rotators
spine-extensors
spine-flexion
spine-flexors
spine-lateral-flexors
spine-ligaments
spine-movement-differs
spinous-process
sternoclavicular-joint
sternoclavicular-ligament
study-group-leaders
styloid-process
subchondral-bone-necrosis
subtalar-joint
subtalar-joint-axis
superficial-anterior-forearm-muscles
superficial-muscles
superficial-posterior-compartment
superior-iliac-spine
superior-pelvis-moves
superior-pubic-ramus
superior-ramus
superior-ribs-move
symphysial-pelvic-dysfunction
synovial-hinge-joints
synovial-joint
synovial-joint-capsule
synovial-joint-lies
tensor-fascia-latae
tensor-fasciae
tensor-fasciae-latae
thickest-cortical-bone
thoracic-vertebra
thoracic-vertebrae-form
thoracic-vertebral-bodies
thoracic-volume-increases-due
thorax-volume-increases
thumb-flexion
thumb-interphalangeal-joint
thumb-movements
thumb-muscles
tibial-plateau
tommy-john-surgery
top-notch-resumes
transverse-carpal-ligament
transverse-forearm-movements
transverse-limb-movements
transverse-pelvis-movements-correspond
transverse-plane-movements
transverse-shoulder-girdle-movements
transverse-trunk-movements
trochlear-notch
trochlear-notch-articulates
trunk-flexion
typical-cervical-vertebrae
typical-loads
typical-synovial-joint
typical-vertebra
ulnar-collateral
ulnar-deviation
ulnar-head-triquetral
ulnar-notch
ulnar-styloid-process
uniaxial-synovial-joint
upper-arm-flex
various-real-world-settings
ventral-sacral-foramina
vertebral-bodies
vertebral-fracture
vertebral-notch
wrist-extensors
wrist-flexion
wrist-flexors
wrist-muscles
year-old-individuals
