abomasum
 absorbance
 absorption
 acetylcholine
 acetylcholinesterase
 acoustic
 adaptation
 agar
 albumin
 aldosterone
 alimentary
 alkaline
 alleles
 alveolus
 amphibian
 amylases
 anaemia
 analysis
 anoxia
 anterior
 antibodies
 antibody
 anticoagulant
 antidiuretic
 antigen
 antigens
 anus
 aorta
 apex
 apoptosis
 appendage
 arteriole
 artery
 articulate
 articulation
 assumptions
 atlas
 atom
 atp
 autosomes
 autotroph
 avoidance
 axis
 axon
 barb
 barbules
 basophil
 biceps
 bilateral
 bile
 binomial
 biocoenosis
 biodiversity
 biomagnification
 biomes
 biotechnology
 blastocyst
 blood
 breed
 bronchiole
 bronchus
 buccal
 callus
 camouflage
 cancer
 canines
 carbohydrate
 carcinogens
 carotene
 carpal
 cartilage
 cataract
 caudal
 cell
 cephalic
 cerebellum
 cerebrum
 cervix
 chemiosmosis
 chemoreceptor
 chloroplast
 choroid
 chromatid
 chromatography
 chromosome
 chyle
 chyme
 cilium
 class
 clavicle
 climate
 clot
 co-factors
 coagulation
 coccyx
 cochlea
 codominance
 codon
 coevolution
 collagen
 colon
 colostrum
 competition
 conduction
 condyle
 cone
 congenital
 conjugation
 conjunctiva
 constipation
 convection
 cornea
 cortex
 costal
 cranial
 cranium
 crop
 crop-milk
 crypsis
 cryptorchidism
 cutaneous
 cytokinesis
 cytology
 cytoplasm
 cytosol
 decomposers
 dehydration
 denaturation
 dendrite
 dentine
 dermis
 dialysis
 diaphragm
 diaphysis
 diarrhoea
 diastema
 diastole
 differentiation
 diffusion
 digestion
 dilate
 diploid
 disaccharides
 distal
 diuretic
 dna
 dorsal
 duodenum
 echolocation
 ecosystem
 ectotherm
 effector
 egestion
 electrolyte
 element
 embryo
 emulsification
 enamel
 endometrium
 endosymbiosis
 endothelium
 endotherm
 enzyme
 enzymes
 eosinophil
 epidemic
 epidermis
 epididymis
 epiglottis
 epiphysis
 erythrocyte
 estuaries
 eukaryote
 eutrophication
 evaporation
 evolution
 excretion
 exocytosis
 expiration
 extension
 fats
 femur
 fermentation
 fertilisation
 fetlock
 fibrin
 fibrinogen
 fibula
 filtrate
 fitness
 flagellum
 flexion
 fluoroxylate
 foetus
 follicle
 foramen
 fossa
 fovea
 gamete
 ganglion
 gene
 genotype
 gestation
 girdle
 gizzard
 gland
 glomerulus
 glottis
 glucose
 glycerol
 glycogen
 glycolysis
 goitre
 gonads
 gradient
 grana
 haematocrit
 haematuria
 haemoglobin
 haemolysis
 haemorrhage
 haploid
 heparin
 hepatic
 heritability
 heterozygous
 hierarchy
 histamine
 hock
 homeostasis
 homeotherm
 homoiothermic
 homozygous
 hormone
 humerus
 hyperglycemia
 hypertension
 hyperthermia
 hypertonic
 hypotension
 hypothalamus
 hypothesis
 hypotonic
 ileum
 immunity
 implantation
 impotence
 incisors
 inferior
 infertility
 inflammation
 ingestion
 inguinal
 inorganic
 insertion
 inspiration
 insulation
 insulin
 internal
 invertebrates
 ion
 isotonic
 jejunum
 keel
 keratin
 kidney
 lactation
 lacteal
 lacuna
 lamellae
 larynx
 lateral
 lens
 leukocyte
 ligament
 ligase
 lipase
 lipases
 lipid
 lipids
 liver
 longitudinal
 lumbar
 lumen
 lung
 lymph
 lymphocyte
 lysosome
 macronutrients
 macrophage
 mandible
 marrow
 matrix
 maxilla
 medial
 mediastinum
 medulla
 meiosis
 melanin
 melatonin
 membrane
 meninges
 mesentery
 metabolism
 metacarpals
 metastasis
 metatarsals
 microfilaments
 microtubule
 microvilli
 mimicry
 mitochondria
 mitochondrion
 mitosis
 molars
 molecule
 monocyte
 monogamy
 monosaccharide
 mortality
 morula
 mrna
 mucus
 mutagens
 mutation
 myelin
 nephron
 nerve
 neuron
 neurosecretions
 neurotransmitter
 neutrophil
 niche
 nitrogen
 nondisjunction
 nucleoid
 nucleolus
 nucleotides
 nucleus
 nutrient
 observation
 oesophagus
 olfactory
 omasum
 oncogene
 orbit
 organ
 organelle
 organic
 organism
 origin
 osmosis
 ossicle
 ossification
 otolith
 ovary
 ovulation
 ovum
 oxyhaemoglobin
 oxytocin
 palate
 palmar
 pancreas
 parasitism
 parturition
 patella
 pathogen
 pcr
 pectoral
 pedigree
 pelvis
 pepsin
 pericardium
 periosteum
 peripheral
 peristalsis
 peritoneum
 ph
 phagocytosis
 phalanges
 pharynx
 phenotype
 phospholipids
 phosphorus
 photomicrograph
 photon
 photophosphorylation
 photoreceptor
 photosynthesis
 phycobilin
 physiology
 phytoplankton
 pinna
 pinocytosis
 placebo
 placenta
 plantar
 plasma
 plasmids
 plastid
 platelets
 pleura
 plexus
 ploidy
 poikilotherm
 poikilothermic
 polyandry
 polygyny
 polysaccharides
 population
 predictions
 preen
 premolars
 probability
 progesterone
 prokaryote
 prolactin
 proteases
 protein
 proximal
 pulmonary
 pulse
 pupil
 pus
 question
 radiation
 radius
 receptor
 reflectance
 reflex
 refraction
 relaxin
 renal
 reticulum
 retina
 ribosome
 rickets
 rna
 rod
 rostral
 rrna
 rumen
 ruminant
 rumination
 runoff
 sacrum
 saliva
 scapula
 sclera
 sebum
 secretion
 semen
 serum
 shock
 shoulder
 sinus
 skull
 solute
 solution
 solvent
 solvent
 solute
 speciation
 species
 spermatozoon
 sphincter
 spleen
 squamous
 starch
 sterile
 sternum
 stifle
 stimulus
 stomach
 stomata
 stroma
 subcutaneous
 subject
 substrate
 sulcus
 superficial
 survivorship
 suture
 symbiosis
 synapse
 system
 systole
 tarsals
 taxonomy
 temperature-pressure-volume
 tendons
 testis
 testosterone
 theory
 thermogenesis
 thermoregulation
 thorax
 thyroxine
 tibia
 tissue
 trachea
 transcription
 transduction
 transformation
 translation
 transmittance
 transpiration
 transverse
 triceps
 triglycerides
 trna
 trunk
 tumor
 turbidity
 ulna
 urea
 ureter
 urethra
 urinalysis
 urine
 uterus
 uv
 vacuole
 vagina
 vane
 vascular
 vasoconstriction
 vasodilation
 vein
 velvet
 ventral
 ventricles
 venule
 vertebrates
 vesicle
 vesicles
 viscera
 viscosity
 vitamin
 wavelength
 xanthophyll
 xylem
 zygote
 photoautotrophs
 herbivores
 absorption-spectrum
 accessory-gland
 accessory-pigments
 acid-rain
 action-potential
 action-spectrum
 active-site
 active-transport
 adaptive-radiation
 adipose-tissue
 adrenal-cortex
 adrenal-medulla
 aerobic-respiration
 algal-blooms
 alimentary-canal
 alternative-hypothesis
 amino-acids
 antagonistic-muscles
 antidiuretic-hormone
 aqueous-humor
 asexual-reproduction
 atrioventricular-valve
 auditory-ossicle
 base-pairs
 basement-membrane
 binocular-vision
 biogeochemical-cycle
 biological-diversity
 biological-organization
 biotic-community
 blind-spot
 blood-pressure
 body-cavity
 bowmans-capsule
 brain-stem
 cardiac-cycle
 cardiac-muscle
 cardiovascular-system
 carnassial-teeth
 carotid-artery
 carrying-capacity
 cell-cycle
 cell-division
 cell-growth
 cell-inclusion
 cell-membrane
 cell-wall
 cellular-respiration
 cerebral-cortex
 cerebrospinal-fluid
 cervical-vertebrae
 chlorophyll-a
 chorionic-gonadotrophin
 coccygeal-vertebrae
 compact-bone
 compentent-cells
 complementary-strands
 concentration-gradient
 conditioned-reflex
 connective-tissue
 continuous-breeding
 control-group
 control-variable
 controlled-experiment
 coronary-artery
 corpus-luteum
 countercurrent-exchange
 courtship-display
 cowpers-gland
 cranial-nerve
 cross-section
 crossing-over
 cystic-fibrosis
 death-rate
 dental-formula
 dependent-variable
 diabetes-insipidus
 diabetes-mellitus
 digitigrade-locomotion
 direct-competition
 directional-terms
 disruptive-coloration
 dissolved-oxygen
 dominant-allele
 draw-conclusions
 ecological-diversity
 ecological-pyramid
 electron-microscope
 electron-transport
 encounter-rate
 endocrine-gland
 endocrine-system
 endoplasmic-reticulum
 enzyme-inhibitor
 epiphyseal-line
 epiphyseal-plate
 epithelial-tissue
 essential-micronutrients
 eustachian-tube
 evaporative-cooling
 exocrine-gland
 exotic-species
 experimental-group
 experimental-variable
 extracellular-fluid
 facilitated-diffusion
 fallopian-tube
 feedback-loop
 feedback-system
 food-web
 foramen-magnum
 functional-caecum
 gall-bladder
 gas-exchange
 gastric-juice
 genetic-code
 genetic-counseling
 genetic-diversity
 germ-cells
 gliding-joint
 glomerular-capsule
 golgi-apparatus
 graafian-follicle
 grey-matter
 growth-factors
 growth-hormone
 guard-cells
 handicap-hypothesis
 handling-time
 haversian-canal
 haversian-system
 heat-radiation
 heritable-traits
 hinge-joint
 homologous-chromosomes
 incomplete-dominance
 independent-assortment
 independent-variable
 induced-ovulation
 infectious-disease
 intercostal-muscles
 interpret-conclusions
 interstitial-fluid
 intervertebral-disc
 intestinal-juice
 intracellular-fluid
 intrasexual-competition
 introduced-species
 j-shaped-curve
 k-channel
 k-pump
 krebs-cycle
 lachrymal-gland
 large-intestine
 limiting-factors
 lordosis-response
 luteinising-hormone
 lymph-node
 lymphatic-capillary
 lymphatic-system
 lymphatic-tissue
 lymphatic-vessel
 mammary-gland
 manipulated-variable
 mate-choice
 mating-strategy
 mating-system
 medulla-oblongata
 metabolic-rate
 middle-ear
 milk-teeth
 minute-volume
 missense-mutation
 na-channel
 na-pump
 nasal-cavity
 natural-selection
 negative-feedback
 nerve-impulse
 neutral-fat
 nictitating-membrane
 nonsence-mutation
 normal-saline
 nuclear-membrane
 observational-experiment
 optic-nerve
 osmotic-pressure
 oval-window
 ovarian-cycle
 ovarian-follicle
 oxidative-phosphorylation
 pancreatic-juice
 paradigm-shift
 parasympathetic-division
 parathyroid-gland
 parathyroid-hormone
 parental-investment
 parotid-gland
 pelvic-cavity
 pelvic-girdle
 peptide-hormones
 pericardial-cavity
 permanent-teeth
 peyers-patches
 phospholipid-bilayer
 photosystem-ii
 photosystems-i
 pineal-gland
 pituitary-gland
 pivot-joint
 plantigrade-locomotion
 plasma-membrane
 plate-tectonics
 pleural-cavity
 point-source-pollution
 population-density
 population-growth
 predictor-variable
 prostate-gland
 pulp-cavity
 punnett-square
 pyloric-sphincter
 random-sampling
 reaction-center
 reading-frame
 receptor-protein
 recessive-allele
 recombinant-dna
 red-algae
 red-marrow
 reflex-arc
 renal-pelvis
 renal-pyramid
 renal-system
 restriction-enzymes
 s-shaped-curve
 sagittal-plane
 sagittal-section
 salivary-amylase
 sample-size
 saturated-fat
 sciatic-nerve
 scramble-competition
 search-image
 search-time
 seasonal-breeding
 sebaceous-gland
 secondary-metabolites
 selective-agent
 selective-permeability
 semi-permeable-membrane
 semicircular-canals
 semilunar-valve
 seminal-vesicle
 seminiferous-tubule
 sensory-neuron
 sesamoid-bones
 sex-chromosomes
 sex-linked-trait
 sexual-reproduction
 sexual-selection
 sham-operation
 size-distribution
 skeletal-muscle
 small-intestine
 smooth-muscle
 soft-palate
 somatic-cell
 species-diversity
 specific-gravity
 sperm-duct
 spermatic-cord
 spinal-cord
 spinal-nerve
 spongy-bone
 statistical-tests
 striated-muscle
 submandibular-gland
 substrate-level-phosphorylation
 supported
 not-supported
 surface-area
 sympathetic-division
 synovial-joint
 systemic-circulation
 target-cell
 thoracic-cavity
 thymus-gland
 thyroid-gland
 tidal-breathing
 tidal-volume
 tissue-fluid
 travel-time
 trophic-pyramid
 tympanic-membrane
 umbilical-cord
 unguligrade-locomotion
 uric-acid
 vagus-nerve
 vas-deferens
 vaso-dilation
 vector-cloning
 vena-cava
 vertebral-canal
 vestibular-organ
 visceral-skeleton
 visual-acuity
 vital-capacity
 vitreous-humor
 warning-coloration
 white-matter
 yellow-marrow
 zona-pellucida
 anterior-pituitary-gland
 atrium-
 atria
 autonomic-nervous-system
 axillary-lymph-node
 caudal-vena-cava
 central-nervous-system
 cilium
 citric-acid-cycle
 common-bile-duct
 core-body-temperature
 diastolic-blood-pressure
 double-blind-experiment
 essential-amino-acids
 exponential-population-growth
 fluid-mosaic-model
 golgi-complex-apparatus
 good-genes
 hepatic-portal
 human-genome
 law-of-q-ten
 dependent-reaction
 independent-reaction
 mode-of-action
 non-point-source
 open-rooted
 optimal-foraging
 peripheral-nervous
 point-source
 primary-consumers
 primary-producers
 restriction-enzyme
 endoplasmic-reticulum
 secondary-sex-characteristic
 smooth-endoplasmic-reticulum
 species-diversity-index
 systolic-blood-pressure
 thermal-neutral-zone
 total-lung-capacity
 villi-and-microvilli
 villus
 visible-light-spectrum
 what-is-science
 ball-and-socket-joint
 follicle
 follicle-stimulating-hormone
 intrinsic-rate-of-increase
 abdominals
 abdominis
 abductors
 abducts
 achilles
 acl
 adducting
 adductors
 aeneus
 amputated
 anatomized
 anatomoge
 anserinus
 anterodistal
 anthropologists
 arthroscope
 articulations
 aspera
 atrophies
 australopithecines
 bequeathed
 biomechanist
 blisters
 bodyweight
 bones
 brachii
 brevis
 cadavers
 capitis
 carpi
 cartilages
 cause
 cervicals
 cervicis
 chihuahuas
 chondrocytes
 condyles
 contralaterally
 contralaterals
 cruciates
 demifacets
 deviates
 diarthroses
 digiti
 digitorum
 disembodied
 dorsi
 dorsiflexed
 dorsiflexes
 dorsiflexors
 electromyography
 embryos
 endoprostheses
 epicondyles
 epimysial
 epiphyses
 extensors
 externus
 fasciae
 fascicles
 femoris
 femurs
 fibers
 fibrocytes
 fingers
 flavum
 flexing
 flexors
 fontanelle
 fontanelles
 footprints
 forces
 fractures
 gemelli
 gesticulating
 gisbertus
 glutus
 gomphoses
 hallucis
 hammies
 hamstrings
 heads
 hernias
 herophilus
 hippocrates
 hyperextended
 internus
 intertransversarius
 ipsilaterally
 jillions
 joints
 knees
 latae
 latissimus
 ligaments
 longissimus
 longus
 lookie
 louvain
 lumborum
 lungs
 malleoli
 manifests
 menisci
 metacarpals
 metatarsals
 midline
 modalities
 mondino
 mris
 multipennate
 muscles
 musculoskeletal
 myofibrils
 myofilaments
 nauseum
 nonaxial
 osteoblasts
 osteoclasts
 osteocytes
 osteons
 overpronator
 overpronators
 palmaris
 palpated
 patellae
 pec
 pedicles
 peroneus
 perpendiculars
 piriformis
 plastination
 postmenopausal
 prevertebrals
 profundus
 pronated
 pronating
 pronators
 prostheses
 proteoglycan
 protracting
 protractors
 protracts
 protruberance
 protuberances
 pterygoids
 pulposis
 pulposus
 pumic
 radialis
 radioulnar
 resorbed
 retinacula
 rhomboids
 rotates
 rotators
 sarcomeres
 scalloped
 scapulae
 secreted
 serratus
 skeletally
 spondylolysis
 stretches
 stretching
 subfibriles
 suboccipitals
 subtalar
 superficialis
 supinated
 supinating
 supinators
 sutures
 suturing
 symphyses
 synarthroses
 synchondroses
 synergists
 tarsals
 temporalis
 tendons
 teres
 tfl
 thoracis
 tibialis
 tissues
 trabeculae
 transversospinales
 transversospinalis
 trendelenburg
 ulnaris
 ultrasound
 valgas
 valgum
 valsalva
 vaselius
 vasti
 vastus
 vesalius
 vessels
 vinci
 